INSERT INTO roles (name) VALUES
('admin'),
('stuff'),
('customer');

INSERT INTO users (name, lastname, email, password, roleid) VALUES
('Иван', 'Иванов', 'ivanov@example.com', 'password123', 1),
('Анна', 'Смирнова', 'smirnova@example.com', 'password456', 2),
('Елена', 'Сидорова', 'sidorova@example.com', 'password012', 2),
('Петр', 'Петров', 'petrov@example.com', 'password789', 3),
('Сергей', 'Кузнецов', 'kuznetsov@example.com', 'password345', 3);

INSERT INTO categories (name) VALUES
('smartphones'),
('laptops'),
('headphones'),
('home-applianсes'),
('tvs'),
('accessories');

INSERT INTO products (name, description, price, quantity, categoryid) VALUES
('Смартфон', 'Современный смартфон', 299.99, 50, 1),
('Ноутбук', 'Мощный ноутбук для работы и игр', 799.99, 30, 2),
('Наушники', 'Качественный звук', 149.99, 30, 3),
('Холодильник', 'Энергоэффективный холодильник', 499.99, 20, 4),
('Пылесос', 'Компактный и мощный пылесос', 199.99, 25, 4),
('Телевизор', 'Большой телевизор с высоким разрешением', 999.99, 15, 5),
('Чехол для телефона', 'Современный минималистичный дизайн', 19.99, 100, 6);

INSERT INTO orders (createdat, userid) VALUES
('2023-12-01 10:00:00', 4),
('2023-12-02 11:00:00', 5),
('2023-12-03 12:00:00', 4),
('2023-12-04 13:00:00', 5),
('2023-12-05 14:00:00', 5);

INSERT INTO order_product (orderid, productid, quantity) VALUES
(1, 1, 2),
(2, 2, 1),
(3, 3, 10),
(4, 4, 2),
(5, 5, 1),
(2, 6, 3),
(2, 7, 2),
(2, 3, 1);

INSERT INTO reviews (userid, productid, content, rating, createdat) VALUES
(4, 1, 'Отличный смартфон!', 10, '2023-10-01 12:00:00'),
(5, 2, 'Ноутбук не очень((', 4, '2023-10-02 13:30:00'),
(4, 3, 'Хороший звук', 9, '2023-10-03 14:15:00'),
(5, 4, 'Немного шумный', 7, '2023-10-04 15:45:00'),
(5, 5, 'Красивый дизайн', 9, '2023-10-05 16:20:00'),
(5, 6, 'Отличная картинка', 10, '2023-10-06 17:00:00'),
(5, 7, 'Очень удобный, но быстро пачкается', 8, '2023-10-07 18:10:00'),
(5, 3, 'Немного странный звук', 8, '2023-10-08 19:30:00');

INSERT INTO journals (userid, action, createdat) VALUES
(1, 'Вход в систему', '2023-10-01 10:00:00'),
(2, 'Оформление заказа', '2023-10-02 11:15:30'),
(3, 'Удаление товара', '2023-10-03 09:45:20'),
(4, 'Добавление в корзину', '2023-10-04 14:30:10'),
(5, 'Смена имени профиля', '2023-10-05 16:00:00');

INSERT INTO addresses (userid, street, house, city, postcode) VALUES
(4, 'Ленина', '12A', 'Минск', '101000'),
(5, 'Пушкина', '5', 'Минск', '190000');

INSERT INTO carts (userid, productid, quantity) VALUES
(4, 1, 2),
(5, 2, 1),
(4, 3, 10),
(5, 4, 2),
(5, 5, 1),
(5, 6, 3),
(5, 7, 2),
(5, 3, 1);






